tap "dough654/omachy"
tap "felixkratz/formulae"
tap "nikitabobko/tap"

# CLI
brew "atuin"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "go"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "opencode"
brew "rust"
brew "starship"
brew "tmux"
brew "uv"
brew "yazi"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Tiling / bar / borders
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "dough654/omachy/omachy"

# Casks
cask "aerospace"
cask "claude-code"
cask "ghostty"
cask "hammerspoon"
cask "ollama-app"
cask "postman"

# Fonts
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
